## Concat
1. 默認情況下是縱向連接，但通過參數設置，也能夠達到橫向連接

In [2]:
import pandas as pd

In [4]:
data_1 = {
    'name': ['Ann', 'Tim', 'Joe', 'John'],
    'email': ['min@gmail.com', 'hchang@gmail.com', 'laioding@gmail.com', 'hsulight@gmail.com'],
    'grades': [60, 77, 92, 43]
}

data_2 = {
    'name': ['Tony', 'Johnny', 'Louis', 'Timmy'],
    'email': ['ww@gmail.com', 'cc@gmail.com', 'bb@gmail.com', 'ee@gmail.com'],
    'grades': [70, 17, 32, 43]
}

df1 = pd.DataFrame(data_1)
df2 = pd.DataFrame(data_2)

print('df1----------------------')
print(df1)
print()
print('df2----------------------')
print(df2)

df1----------------------
   name               email  grades
0   Ann       min@gmail.com      60
1   Tim    hchang@gmail.com      77
2   Joe  laioding@gmail.com      92
3  John  hsulight@gmail.com      43

df2----------------------
     name         email  grades
0    Tony  ww@gmail.com      70
1  Johnny  cc@gmail.com      17
2   Louis  bb@gmail.com      32
3   Timmy  ee@gmail.com      43

### *1. Two DataFrames with same columns.*

In [5]:
df_concat = pd.concat([df1, df2])
df_concat

     name               email  grades
0     Ann       min@gmail.com      60
1     Tim    hchang@gmail.com      77
2     Joe  laioding@gmail.com      92
3    John  hsulight@gmail.com      43
0    Tony        ww@gmail.com      70
1  Johnny        cc@gmail.com      17
2   Louis        bb@gmail.com      32
3   Timmy        ee@gmail.com      43

In [6]:
# ignore_index=True 時index會重置

df_concat_ignore_index = pd.concat([df1, df2], ignore_index = True)
df_concat_ignore_index

     name               email  grades
0     Ann       min@gmail.com      60
1     Tim    hchang@gmail.com      77
2     Joe  laioding@gmail.com      92
3    John  hsulight@gmail.com      43
4    Tony        ww@gmail.com      70
5  Johnny        cc@gmail.com      17
6   Louis        bb@gmail.com      32
7   Timmy        ee@gmail.com      43

### *2. Two DataFrames with not exactly same columns.*

In [3]:
df3 = pd.DataFrame([['a', 1], ['b', 2]],
                columns=['letter', 'number'])

df4 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                  columns=['letter', 'number', 'animal'])

print('df3')
print(df3)
print()
print('------------')
print()
print('df4')
print(df4)

df3
  letter  number
0      a       1
1      b       2

------------

df4
  letter  number animal
0      c       3    cat
1      d       4    dog

***2.1 Join all columns as default***
- if want to join the DataFrame as we want, we could set `join='inner'`
- `sort=False` let the index remain the same sorts.

In [7]:
df_not_same_col = pd.concat([df3,df4], sort=False)
df_not_same_col

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [8]:
df_not_same_col_inner = pd.concat([df3,df4], sort=False, join='inner')
df_not_same_col_inner

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

### *3. Join DataFrames by `index`.*

In [17]:
df5 = pd.DataFrame([['a', 1], ['b', 2]],
                columns=['letter', 'number'])

df6 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                  columns=['animal', 'name'])

df7 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george'], ['snake','joe']],
                  columns=['animal', 'name'])

df8 = pd.DataFrame([['bird', 'polly', 18], ['monkey', 'george', 20]],
                  columns=['animal', 'name', 'age'])

df9 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                  columns=['animal', 'name'])
df9.index = [4,5]

print('df5')
print(df5)
print()
print('------------')
print()
print('df6')
print(df6)
print()
print('------------')
print()
print('df7')
print(df7)
print()
print('------------')
print()
print('df8')
print(df8)
print()
print('------------')
print()
print('df9')
print(df9)

df5
  letter  number
0      a       1
1      b       2

------------

df6
   animal    name
0    bird   polly
1  monkey  george

------------

df7
   animal    name
0    bird   polly
1  monkey  george
2   snake     joe

------------

df8
   animal    name  age
0    bird   polly   18
1  monkey  george   20

------------

df9
   animal    name
4    bird   polly
5  monkey  george

***3.1 Two DataFrame `index` exactly the same.***

In [12]:
pd.concat([df5,df6], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

***3.2 Two DataFrame `index` exactly the same, with different `columns`.***

In [14]:
pd.concat([df5,df8], axis=1)

  letter  number  animal    name  age
0      a       1    bird   polly   18
1      b       2  monkey  george   20

***3.3 Two DataFrame with differet `index`.***

In [13]:
pd.concat([df5,df7], axis=1)

  letter  number  animal    name
0      a     1.0    bird   polly
1      b     2.0  monkey  george
2    NaN     NaN   snake     joe

In [18]:
pd.concat([df5,df9], axis=1)

  letter  number  animal    name
0      a     1.0     NaN     NaN
1      b     2.0     NaN     NaN
4    NaN     NaN    bird   polly
5    NaN     NaN  monkey  george